Autodesk.Revit.DB.ThermalAsset.#ctor(System.String,Autodesk.Revit.DB.ThermalMaterialType)
Constructs an instance of ThermalAsset.
name:
The name of the asset.
materialType:
The type of thermal material that this asset will describe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013